var names = [
  ["구", "하", "림"],
  ["김", "보", "미"],
  ["김", "수", "현"],
  ["김", "정", "수"],
  ["문", "혜", "림"],
  ["배", "성", "빈"],
  ["백", "지", "원"],
  ["송", "이", "현"],
  ["신", "지", "윤"],
  ["유", "으", "뜸"],
  ["유", "호", "영"],
  ["이", "연", "승"],
  ["이", "재", "영"],
  ["이", "종", "수"],
  ["임", "유", "진"],
  ["정", "호", "연"],
  ["조", "우", "식"],
  ["조", "자", "연"],
  ["최", "유", "진"],
  ["황", "재", "민"]
]

for(let nIdx = 0 ; nIdx < names.length ; nIdx++)
{
  let charSet = names[nIdx];
  let name = "";
  for(nIdx_2 = 0 ; nIdx_2 < charSet.length ; nIdx_2++)
  {
    name += charSet[nIdx_2];
  }

  if(name == "황재민")
    console.log(name);
}